
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/nyshk97/aws-ecs-terraform/actions/runs/6258988165)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-083229c009d2de319]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0581be1e8fb9f4a87]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b6e7990e665c661f]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09f326f6a06eef180]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07a38580cf08b9976]
aws_security_group.ecs: Refreshing state... [id=sg-0d988622b7767ecfd]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:413826436775:targetgroup/go-simple-server-target-group/de495f82d481b490]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-01db1c87703bd6a1d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e2ae3c2ef6c9deac]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0cb8be38df8114563]
aws_security_group.alb: Refreshing state... [id=sg-03345e2bb275c36d0]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ded2aaadc5bb0224]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0d03142caa758fc29]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-07300af33a9c001a8]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0807f0dec95bec02b]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3223306409]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09141fa82cbb4af19]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0183803c6e9b85e9b]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:413826436775:loadbalancer/app/go-simple-server-alb/e7b741708e939369]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a9c4fbae37afe4e5]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0734164d7a254ad13]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b13f439843b02a26]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0f509b7de90ca1df0]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0cb8be38df81145631080289494]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-01d5f76fbea4c8cac]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-039e20af860695e54]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ded2aaadc5bb02241080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0d03142caa758fc291080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:413826436775:listener/app/go-simple-server-alb/e7b741708e939369/5305c0d310d84cb1]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:413826436775:listener-rule/app/go-simple-server-alb/e7b741708e939369/5305c0d310d84cb1/bf80c2b56a7e5e6b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"c4b8ab166871fa85606ad5e95c918170a5bed10e","Vars":{},"WorkflowName":"Terraform"} -->